eisup_2019_docmng_integration/src/Enums/СтратегииОтраженияВРеглУчетеНачислений/СтратегииОтраженияВРеглУчетеНачислений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтратегииОтраженияВРеглУчетеНачислений</name>
  <enumValues>
    <name>КакЗаданоВидуРасчета</name>
  </enumValues>
  <enumValues>
    <name>КакЗаданоНаНачалоСобытия</name>
  </enumValues>
  <enumValues>
    <name>КакБазовыеНачисления</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ОтнесениеРасходовКДеятельностиЕНВД/ОтнесениеРасходовКДеятельностиЕНВД.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ОтнесениеРасходовКДеятельностиЕНВД</name>
  <enumValues>
    <name>РасходыОтносятсяКнеЕНВД</name>
  </enumValues>
  <enumValues>
    <name>РасходыОтносятсяКЕНВД</name>
  </enumValues>
  <enumValues>
    <name>РасходыРаспределяются</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/СпособыРасчетаОплатыТруда/СпособыРасчетаОплатыТруда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаОплатыТруда</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ДоначислениеПоУправленческомуУчету</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаВечерниеЧасы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ДоплатаЗаНочныеЧасы</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПочтовыйСбор</name>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентом</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистПроцентомДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ИсполнительныйЛистФиксСуммойДоПредела</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>НулеваяСумма</name>
    <comment>(Общ) ВР без расчета результата</comment>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоДневнойТарифнойСтавке</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоМесячнойТарифнойСтавкеПоДням</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоМесячнойТарифнойСтавкеПоЧасам</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПоЧасовойТарифнойСтавке</name>
  </enumValues>
  <enumValues>
    <name>ОтСтажаПроцентом</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговоруФиксированнойСуммой</name>
  </enumValues>
  <enumValues>
    <name>ПоДневнойТарифнойСтавке</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоДням</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоМесячнойТарифнойСтавкеПоЧасам</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоЧасовойТарифнойСтавке</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДо1_5Лет</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПособиеПоУходуЗаРебенкомДо3Лет</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработка</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработку</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуДляОтпускаПоКалендарнымДням</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуДляОтпускаПоШестидневке</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>ПоСреднемуЗаработкуФСС</name>
    <comment>(Регл)</comment>
  </enumValues>
  <enumValues>
    <name>Процентом</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроцентомОтОблагаемыхЕСННачислений</name>
  </enumValues>
  <enumValues>
    <name>СдельныйЗаработок</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>СевернаяНадбавка</name>
  </enumValues>
  <enumValues>
    <name>УдержаниеФиксированнойСуммой</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьПоЧасовойТарифнойСтавкеДляПочасовогоОтклонения</name>
    <comment>(Общ) Более не используется</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьПоСреднемуЗаработкуДляПочасовогоОтклонения</name>
    <comment>Более не используется</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьФиксированнойСуммойДляПочасовогоОтклонения</name>
    <comment>(Общ) Более не используется</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьПоМесячнойТарифнойСтавкеПоЧасамДляПочасовогоОтклонения</name>
    <comment>(Общ) Более не используется</comment>
  </enumValues>
  <enumValues>
    <name>УдалитьМаксП1УП2_П3УП4ДП5</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1ДП2ОП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1ДП2УП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1ОП2</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1ОП2ДП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1ОП2УП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1УП2</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1УП2ДП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1УП2ОП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1УП2УП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП3ДП1ОП2</name>
  </enumValues>
  <enumValues>
    <name>УдалитьП1УП2УП3ДП4</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМаксП1_П2УП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМинП1_П2УП3</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМаксП1_П2УП3ОП4</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМинП1_П2УП3ОП4</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМаксП1УП2_П5ДП3УП4</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМаксП1УП2ДП3ВП4_0</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМаксП1ВП2_0</name>
  </enumValues>
  <enumValues>
    <name>УдалитьМаксП1_П2УП3УП4ДП5</name>
  </enumValues>
  <enumValues>
    <name>УдалитьНулеваяСуммаДляПочасовогоОтклонения</name>
    <comment>(Общ) Более не используется</comment>
  </enumValues>
  <enumValues>
    <name>ФиксированнойСуммой</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПроизвольнаяФормула</name>
  </enumValues>
  <enumValues>
    <name>ДоплатаДоСреднегоЗаработкаФСС</name>
    <comment>(Регл)</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыВремени/ВидыВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыВремени</name>
  <enumValues>
    <name>ОтработанноеВПределахНормы</name>
    <comment>Начисление за работу полную рабочую смену в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ОтработанноеСверхНормы</name>
    <comment>Начисление за работу сверх нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЦелодневноеНеотработанное</name>
    <comment>Неотработанные полные смены</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеНеотработанное</name>
    <comment>Неотработанные неполные смены</comment>
  </enumValues>
  <enumValues>
    <name>ДополнительноОплачиваемоеВПределахНормы</name>
    <comment>Дополнительное начисление в пределах нормы времени</comment>
  </enumValues>
  <enumValues>
    <name>ЧасовоеОтработанноеВПределахНормы</name>
    <comment>Начисление за работу неполную смену в пределах нормы времени</comment>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ДоходыФСС_НС/ДоходыФСС_НС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ДоходыФСС_НС</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>Облагается</name>
  </enumValues>
  <enumValues>
    <name>НеОблагается</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Catalogs/КлассификаторИспользованияРабочегоВремени/КлассификаторИспользованияРабочегоВремени.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>КлассификаторИспользованияРабочегоВремени</name>
  <comment>(Регл)</comment>
  <predefined>
    <items>
      <name>ВыходныеДни</name>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоРазрешениюРаботодателя</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйОтпускПоЗаконодательству</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>НеоплачиваемыйДополнительныйОтпуск</name>
      <description>БезОпл</description>
    </items>
    <items>
      <name>ОтпускПоБеременностиИРодам</name>
      <description>Бер-ть</description>
    </items>
    <items>
      <name>Болезнь</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>БолезньБезОплаты</name>
      <description>Болезнь</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниНеОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныеВыходныеДниОплачиваемые</name>
      <description>Выход-е</description>
    </items>
    <items>
      <name>ДополнительныйОтпуск</name>
      <description>ДОтпуск</description>
    </items>
    <items>
      <name>Забастовка</name>
      <description>Забасто</description>
    </items>
    <items>
      <name>ЗадержкаВыплатыЗаработнойПлаты</name>
      <description>Задержк</description>
    </items>
    <items>
      <name>ПовышениеКвалификации</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>ПовышениеКвалификацииВДругойМестности</name>
      <description>Кв-ия</description>
    </items>
    <items>
      <name>Командировка</name>
      <description>Ком-ка</description>
    </items>
    <items>
      <name>НеявкиПоНевыясненнымПричинам</name>
      <description>Неявки </description>
    </items>
    <items>
      <name>ОтпускНаОбучениеНеоплачиваемый</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ОтпускНаОбучение</name>
      <description>Обуч-ие</description>
    </items>
    <items>
      <name>ГосударственныеОбязанности</name>
      <description>Обяз-ти</description>
    </items>
    <items>
      <name>ОсновнойОтпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыБезОплаты</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтстранениеОтРаботыСОплатой</name>
      <description>Отстр-е</description>
    </items>
    <items>
      <name>ОтпускПоУходуЗаРебенком</name>
      <description>ПоУходу</description>
    </items>
    <items>
      <name>ВынужденныйПрогул</name>
      <description>Прогул</description>
    </items>
    <items>
      <name>Прогулы</name>
      <description>Прогулы</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботодателя</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Простой</name>
      <description>Простой</description>
    </items>
    <items>
      <name>ПростойПоВинеРаботника</name>
      <description>Простой</description>
    </items>
    <items>
      <name>Работа</name>
      <description>Работа </description>
    </items>
    <items>
      <name>РаботаВечерниеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>РаботаНочныеЧасы</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Сверхурочные</name>
      <description>Работа</description>
    </items>
    <items>
      <name>Праздники</name>
      <description>Работа</description>
    </items>
  </predefined>
  <attributes>
    <name>БуквенныйКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦифровойКод</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеНаименование</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьВидВремени</name>
    <type>
      <types>EnumRef.ВидыВремени</types>
    </type>
  </attributes>
  <attributes>
    <name>РабочееВремя</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/Catalogs/СпособыОтраженияЗарплатыВРеглУчете/СпособыОтраженияЗарплатыВРеглУчете.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СпособыОтраженияЗарплатыВРеглУчете</name>
  <comment>(Регл)</comment>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>НеОтражатьВБухучете</name>
      <description>Не отражать в бухучете</description>
    </items>
    <items>
      <name>БольничныйЗаСчетРаботодателя</name>
      <description>Отражение доли больничного за счет работодателя</description>
    </items>
    <items>
      <name>ОтражениеНачисленийПоУмолчанию</name>
      <description>Отражение начислений по умолчанию</description>
    </items>
    <items>
      <name>РаспределятьПоБазовымНачислениям</name>
      <description>Распределять пропорционально базовым начислениям</description>
    </items>
  </predefined>
  <attributes>
    <name>СчетДт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДт3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособРаспределенияЗатрат</name>
    <type>
      <types>CatalogRef.СпособыРаспределенияЗатратНаВыпуск</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКт</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКт3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетДтНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДтНУ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДтНУ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоДтНУ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетКтНУ</name>
    <type>
      <types>ChartOfAccountsRef.Налоговый</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКтНУ1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКтНУ2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>СубконтоКтНУ3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>РасходыУСН</name>
    <type>
      <types>EnumRef.ОтражениеВУСН</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеДт</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеКт</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидНачисленийОплатыТрудаПоСтатье255НК</name>
    <type>
      <types>EnumRef.ВидыНачисленийОплатыТрудаПоСт255НК</types>
    </type>
  </attributes>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/CommonModules/ОбновлениеИнформационнойБазыСервер/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////
//ЗАРПЛАТА И УПРАВЛЕНИЕ ПЕРСОНАЛОМ

// Устанавливает реквизиты элемента плана видов расчета "ОсновныеНачисленияОрганизаций" 
//
Процедура УстановитьРеквизитыОсновногоНачисленияОрганизации(
								ВидРасчета,
								СпособРасчета,
								ВидВремени,
								КатегорияРасчета,
								ОбозначениеВТабелеУчетаРабочегоВремени,
								ЗачетОтработанногоВремени,
								ЗачетНормыВремени,
								КодДоходаНДФЛ = Неопределено,
								КодДоходаЕСН = Неопределено,
								КодДоходаСтраховыеВзносы = Неопределено,
								КодДоходаФСС_НС,
								СпособОтраженияВБухучете = Неопределено,
								ВидНачисленияПоСт255НК = Неопределено,
								ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = Неопределено,
								ПериодДействияБазовый = Ложь,
								ПроверятьПравильностьУстановкиРеквизитов = Истина,
								ВидПособияСоциальногоСтрахования = Неопределено) Экспорт

	Если ТипЗнч(ОбозначениеВТабелеУчетаРабочегоВремени) = Тип("Строка") Тогда
		КодУчетаРабочегоВремени = Справочники.КлассификаторИспользованияРабочегоВремени.НайтиПоРеквизиту("БуквенныйКод", СокрЛП(ОбозначениеВТабелеУчетаРабочегоВремени));
	Иначе
		КодУчетаРабочегоВремени = ОбозначениеВТабелеУчетаРабочегоВремени
	КонецЕсли;

	ОбъектВР = ВидРасчета.ПолучитьОбъект();
	
	ОбъектВР.СпособРасчета							= СпособРасчета;
	ОбъектВР.ВидВремени								= ВидВремени;
	ОбъектВР.КатегорияРасчета						= КатегорияРасчета;
	ОбъектВР.ОбозначениеВТабелеУчетаРабочегоВремени = КодУчетаРабочегоВремени;
	ОбъектВР.ЗачетОтработанногоВремени              = ЗачетОтработанногоВремени;
	ОбъектВР.ЗачетНормыВремени                      = ЗачетНормыВремени;
	ОбъектВР.КодДоходаНДФЛ                          = КодДоходаНДФЛ;
	ОбъектВР.КодДоходаЕСН                           = КодДоходаЕСН;
	ОбъектВР.КодДоходаСтраховыеВзносы               = КодДоходаСтраховыеВзносы;
	ОбъектВР.КодДоходаФСС_НС				        = КодДоходаФСС_НС;
	ОбъектВР.СпособОтраженияВБухучете               = СпособОтраженияВБухучете;
	ОбъектВР.ВидПособияСоциальногоСтрахования       = ВидПособияСоциальногоСтрахования;
	ОбъектВР.СтратегияОтраженияВУчете               = ?(СпособОтраженияВБухучете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.РаспределятьПоБазовымНачислениям, Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакБазовыеНачисления,
														?(ЗначениеЗаполнено(СпособОтраженияВБухучете), Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоВидуРасчета,Перечисления.СтратегииОтраженияВРеглУчетеНачислений.КакЗаданоНаНачалоСобытия));
	ОбъектВР.ВидНачисленияПоСт255НК                 = ВидНачисленияПоСт255НК;
	ОбъектВР.ОтнесениеРасходовКДеятельностиЕНВД     = ?(КодДоходаЕСН = Справочники.ДоходыЕСН.ВыплатыЗаСчетПрибыли,Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыОтносятсяКнеЕНВД,Перечисления.ОтнесениеРасходовКДеятельностиЕНВД.РасходыРаспределяются);
	ОбъектВР.ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка = ПорядокОпределенияРасчетногоПериодаСреднегоЗаработка;
	ОбъектВР.ВидСтажаСЗВ4 = ПроцедурыПерсонифицированногоУчетаПереопределяемый.ПолучитьПорядокВключенияПериодаВСтраховойСтаж(ВидПособияСоциальногоСтрахования, ВидВремени, КодУчетаРабочегоВремени);

	Если НЕ ОбъектВР.Предопределенный Тогда
		ОбъектВР.ПериодДействияБазовый = ПериодДействияБазовый;
	КонецЕсли;
	
	Если НЕ ПроверятьПравильностьУстановкиРеквизитов Тогда
		ОбъектВР.ОбменДанными.Загрузка = Истина;
	КонецЕсли;
	
	Попытка
		ОбъектВР.Записать();
	Исключение
		
	КонецПопытки;
	
КонецПроцедуры // УстановитьРеквизитыОсновногоНачисленияОрганизации()

// Процедура заполняет реквизиты ВР (в т.ч. вытесняемые и вытесняющие начисления)
// Запускается при обновлении на 1.2.15
//
Процедура ЗаполнитьРеквизитыПВРДниНеоплачиваемыеСогласноТабелю()Экспорт
	
	// Заполнение реквизитов для Вида расчета ДниНеоплачиваемыеСогласноТабелю
	СпРасчета  = Перечисления.СпособыРасчетаОплатыТруда;
	НеОтражатьВБухУчете = Справочники.СпособыОтраженияЗарплатыВРеглУчете.НеОтражатьВБухучете;
	УчетВремени = Справочники.КлассификаторИспользованияРабочегоВремени;
	АнализируемоеНачисление = ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДниНеоплачиваемыеСогласноТабелю;
	УстановитьРеквизитыОсновногоНачисленияОрганизации(АнализируемоеНачисление, СпРасчета.НулеваяСумма, Перечисления.ВидыВремени.ЦелодневноеНеотработанное, Справочники.КатегорииРасчетов.Первичное, УчетВремени.НеявкиПоНевыясненнымПричинам, Ложь,   Истина, , , , Перечисления.ДоходыФСС_НС.Облагается, НеОтражатьВБухУчете,,,,Ложь);
	
	СписокПредопределенныхВытесняющихПВР = Новый Массив;
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеВБыту);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыУчебный);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаБЛПоТравмеНаПроизводстве);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуБЛ);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаВыходныхДнейПоУходуЗаДетьмиИнвалидами);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпКалендарныеДни);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднемуОтпШестидневка);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОплатаПоСреднему);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойОкладПоДням);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойОкладПоЧасам);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойТарифДневной);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойТарифЧасовой);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускБезОплатыПоТКРФ);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускЗаСвойСчет);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтпускПоБеременностиИРодам);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтсутствиеПоБолезни);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОтсутствиеПоБолезниПоБеременности);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Прогул);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ПростойПоВинеРаботодателя);
	СписокПредопределенныхВытесняющихПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Невыход);
	
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СписокПВР", СписокПредопределенныхВытесняющихПВР);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыбранныеВР.ВидРасчета,
	|	ВЫБОР
	|		КОГДА ВыбранныеВР.ВидРасчета В (&СписокПВР)
	|			ТОГДА 2
	|		ИНАЧЕ 1
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета КАК ВидРасчета
	|	ИЗ
	|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
	|	ГДЕ
	|		ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка В(&СписокПВР)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ОсновныеНачисленияОрганизаций.Ссылка
	|	ИЗ
	|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|	ГДЕ
	|		ОсновныеНачисленияОрганизаций.Ссылка В(&СписокПВР)) КАК ВыбранныеВР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
	|		ПО ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета = ВыбранныеВР.ВидРасчета
	|			И (ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДниНеоплачиваемыеСогласноТабелю))
	|ГДЕ
	|	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
				   
	АнализируемоеНачислениеОбъект = АнализируемоеНачисление.ПолучитьОбъект();			   
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		АнализируемоеНачислениеОбъект.ВытесняющиеВидыРасчета.Добавить().ВидРасчета = Выборка.ВидРасчета;
	КонецЦикла;
	АнализируемоеНачислениеОбъект.ОбменДанными.Загрузка = Истина;
	АнализируемоеНачислениеОбъект.Записать();
	
	СписокПредопределенныхВытесняемыхПВР = Новый Массив;
	СписокПредопределенныхВытесняемыхПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаВечерниеЧасы);
	СписокПредопределенныхВытесняемыхПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДоплатаЗаНочныеЧасы);
	СписокПредопределенныхВытесняемыхПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоДням);
	СписокПредопределенныхВытесняемыхПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ОкладПоЧасам);
	СписокПредопределенныхВытесняемыхПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифДневной);
	СписокПредопределенныхВытесняемыхПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ТарифЧасовой);
	СписокПредопределенныхВытесняемыхПВР.Добавить(ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.СдельнаяОплата);
	Запрос.УстановитьПараметр("СписокПВР", СписокПредопределенныхВытесняемыхПВР);
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВыбранныеВР.ВидРасчета,
	|	ВЫБОР
	|		КОГДА ВыбранныеВР.ВидРасчета В (&СписокПВР)
	|			ТОГДА 1
	|		ИНАЧЕ 2
	|	КОНЕЦ КАК Порядок
	|ИЗ
	|	(ВЫБРАТЬ
	|		ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка КАК ВидРасчета
	|	ИЗ
	|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
	|	ГДЕ
	|		ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета В(&СписокПВР)
	|	
	|	ОБЪЕДИНИТЬ
	|	
	|	ВЫБРАТЬ
	|		ОсновныеНачисленияОрганизаций.Ссылка
	|	ИЗ
	|		ПланВидовРасчета.ОсновныеНачисленияОрганизаций КАК ОсновныеНачисленияОрганизаций
	|	ГДЕ
	|		ОсновныеНачисленияОрганизаций.Ссылка В(&СписокПВР)) КАК ВыбранныеВР
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
	|		ПО ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка = ВыбранныеВР.ВидРасчета
	|			И (ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ДниНеоплачиваемыеСогласноТабелю))
	|ГДЕ
	|	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка ЕСТЬ NULL 
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписываемоеНачислениеОбъект = Выборка.ВидРасчета.ПолучитьОбъект();
		ЗаписываемоеНачислениеОбъект.ВытесняющиеВидыРасчета.Добавить().ВидРасчета = АнализируемоеНачисление;
		ЗаписываемоеНачислениеОбъект.ОбменДанными.Загрузка = Истина;
		ЗаписываемоеНачислениеОбъект.Записать();
	КонецЦикла;
	
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
				   |	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка Как ВидРасчета
				   |ИЗ
				   |	ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
				   |ГДЕ
				   |	ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка <> &ПВРТабель
				   |	И ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета = &ПВРНеявка
				   |	И (НЕ ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка В
				   |				(ВЫБРАТЬ
				   |					ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.Ссылка
				   |				ИЗ
				   |					ПланВидовРасчета.ОсновныеНачисленияОрганизаций.ВытесняющиеВидыРасчета КАК ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета
				   |				ГДЕ
				   |					ОсновныеНачисленияОрганизацийВытесняющиеВидыРасчета.ВидРасчета = &ПВРТабель))";
	Запрос.УстановитьПараметр("ПВРТабель", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.ДниНеоплачиваемыеСогласноТабелю);
	Запрос.УстановитьПараметр("ПВРНеявка", ПланыВидовРасчета.ОсновныеНачисленияОрганизаций.Невыход);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаписываемоеНачислениеОбъект = Выборка.ВидРасчета.ПолучитьОбъект();
		ЗаписываемоеНачислениеОбъект.ВытесняющиеВидыРасчета.Добавить().ВидРасчета = АнализируемоеНачисление;
		ЗаписываемоеНачислениеОбъект.ОбменДанными.Загрузка = Истина;
		ЗаписываемоеНачислениеОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры
